---
kind: method
id: M:Autodesk.Revit.DB.ReferenceWithContext.Dispose
source: html/6163954f-3321-2565-bc9c-2cd25e0cec29.htm
---
# Autodesk.Revit.DB.ReferenceWithContext.Dispose Method

Releases all resources used by the ReferenceWithContext

## Syntax (C#)
```csharp
public void Dispose()
```